In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:koushik16@localhost/

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [3]:
%%sql
use world

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [6]:
%%sql
DROP TABLE CustomerData;
CREATE TABLE CustomerData (
    id INT PRIMARY KEY,
    customer_name VARCHAR(100),
    email VARCHAR(100),
    phone_number VARCHAR(15),
    address VARCHAR(200),
    amount DECIMAL(10, 2)
);

INSERT INTO CustomerData VALUES
(1, 'Ravi', 'ravi@example.com', '9876', 'Chennai', 5000.00),
(2, 'Priya', NULL, '9876', 'Bangalore', NULL),
(3, 'Arjun', 'arjun@example.com', NULL, 'Hyderabad', 1500.00),
(4, 'Meena', NULL, NULL, 'Mumbai', 2500.00),
(5, 'Karthik', 'karthik@example.com', '9876', NULL, 3000.00);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.
5 rows affected.

[]

In [10]:
%%sql
SELECT 
    id,
    customer_name,
    -- Extract the length of the customer name
    LENGTH(customer_name) AS name_length
FROM 
    CustomerData;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(1, 'Ravi', 4),
 (2, 'Priya', 5),
 (3, 'Arjun', 5),
 (4, 'Meena', 5),
 (5, 'Karthik', 7)]

In [12]:
%%sql
SELECT 
    UPPER(customer_name) AS uppercase_name,
    LOWER(customer_name) AS lowercase_name
FROM 
    CustomerData;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('RAVI', 'ravi'),
 ('PRIYA', 'priya'),
 ('ARJUN', 'arjun'),
 ('MEENA', 'meena'),
 ('KARTHIK', 'karthik')]

In [14]:
%%sql
SELECT 
     CONCAT(customer_name, ' - ', COALESCE(phone_number, '00000')) AS contact_info
FROM 
    CustomerData;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('Ravi - 9876',),
 ('Priya - 9876',),
 ('Arjun - 00000',),
 ('Meena - 00000',),
 ('Karthik - 9876',)]

In [15]:
%%sql
SELECT 
    SUBSTRING(customer_name, 1, 5) AS name_prefix
FROM 
    CustomerData;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('Ravi',), ('Priya',), ('Arjun',), ('Meena',), ('Karth',)]

In [16]:
%%sql
SELECT 
TRIM('   ExampleCity   ') AS trimmed_city
FROM 
    CustomerData;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('ExampleCity',),
 ('ExampleCity',),
 ('ExampleCity',),
 ('ExampleCity',),
 ('ExampleCity',)]

In [17]:
%%sql
SELECT 
    LPAD(customer_name, 15, '*') AS left_padded_name,
    RPAD(customer_name, 15, '-') AS right_padded_name

FROM 
    CustomerData;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('***********Ravi', 'Ravi-----------'),
 ('**********Priya', 'Priya----------'),
 ('**********Arjun', 'Arjun----------'),
 ('**********Meena', 'Meena----------'),
 ('********Karthik', 'Karthik--------')]

In [18]:
%%sql
SELECT 
    REPLACE(customer_name, ' ', '_') AS updated_name
FROM 
    CustomerData;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('Ravi',), ('Priya',), ('Arjun',), ('Meena',), ('Karthik',)]

In [19]:
%%sql
SELECT 
    INSTR(customer_name, 'a') AS position_of_a
FROM 
    CustomerData;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(2,), (5,), (1,), (5,), (2,)]

In [20]:
%%sql
SELECT 
    LEFT(customer_name, 5) AS first_5_chars,
    RIGHT(customer_name, 5) AS last_5_chars
FROM 
    CustomerData;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('Ravi', 'Ravi'),
 ('Priya', 'Priya'),
 ('Arjun', 'Arjun'),
 ('Meena', 'Meena'),
 ('Karth', 'rthik')]

In [21]:
%%sql
SELECT 
    REVERSE(customer_name) AS reversed_name
FROM 
    CustomerData;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('ivaR',), ('ayirP',), ('nujrA',), ('aneeM',), ('kihtraK',)]

In [ ]:
%%sql
SELECT 
    
FROM 
    CustomerData;